{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "use_bias": true, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 32}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "name": "dense_1", "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "name": "dense_2", "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}